
## Plan Result (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9839073461)


<pre><code>Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * github_issue_label.dependencies[&#34;major&#34;]
* Update
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]
* Import
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_issue_label.dependencies["dependencies"] will be updated in-place
  # (imported from "dotfiles:dependencies")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "0366d6" -> "0366D6"
        description = "Pull requests that update a dependency file"
        etag        = "W/\"bace6afa22ee2f2e8a47602e813e1570d0992eccca77d4b3e660ba8ea3e26d06\""
        id          = "dotfiles:dependencies"
        name        = "dependencies"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/dependencies"
    }

  # github_issue_label.dependencies["major"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "FF0000"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "major"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

  # github_issue_label.dependencies["minor"] will be updated in-place
  # (imported from "dotfiles:minor")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "00FF00"
        description = null
        etag        = "W/\"10afd755d85270d117ad54101be800466a6f69fc2db899e7cf964e760115622d\""
        id          = "dotfiles:minor"
        name        = "minor"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/minor"
    }

  # github_issue_label.dependencies["patch"] will be updated in-place
  # (imported from "dotfiles:patch")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "0000FF"
        description = null
        etag        = "W/\"6d586efdaa47a19ff65d0398551ddab3aa490fc718965c7b1af0e97f7a5a7876\""
        id          = "dotfiles:patch"
        name        = "patch"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/patch"
    }

Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":159,"Program":"tfcmt","SHA1":"d8c4b65e48b875e8c2c83d194a4f6c012587ac1b","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->